Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1024, 1024,  0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 1024, 1024, 6 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 1024, 1024, 6 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 512, 512, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 512, 512, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 512, 512, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 256, 256, 128 0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 256, 256, 256 295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 256, 256, 256 590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 256, 256, 256 590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv4 (Conv2D)           (None, 256, 256, 256 590080      block3_conv3[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 128, 128, 256 0           block3_conv4[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 128, 128, 512 1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 128, 128, 512 2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 128, 128, 512 2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_conv4 (Conv2D)           (None, 128, 128, 512 2359808     block4_conv3[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 64, 64, 512)  0           block4_conv4[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 64, 64, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 64, 64, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 64, 64, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
block5_conv4 (Conv2D)           (None, 64, 64, 512)  2359808     block5_conv3[0][0]               
__________________________________________________________________________________________________
block5_pool (MaxPooling2D)      (None, 32, 32, 512)  0           block5_conv4[0][0]               
__________________________________________________________________________________________________
block6_conv1 (Conv2D)           (None, 32, 32, 128)  65664       block5_pool[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32, 32, 128)  0           block6_conv1[0][0]               
__________________________________________________________________________________________________
block6_conv2 (Conv2D)           (None, 32, 32, 128)  16512       dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 32, 128)  0           block6_conv2[0][0]               
__________________________________________________________________________________________________
table_mask (table_mask)         (None, 1024, 1024, 2 32642       dropout_1[0][0]                  
                                                                 block3_pool[0][0]                
                                                                 block4_pool[0][0]                
__________________________________________________________________________________________________
col_mask (col_mask)             (None, 1024, 1024, 2 49154       dropout_1[0][0]                  
                                                                 block3_pool[0][0]                
                                                                 block4_pool[0][0]                
==================================================================================================
Total params: 20,188,356
Trainable params: 163,972
Non-trainable params: 20,024,384
__________________________________________________________________________________________________
